BUILD/doc/source/_static/soap_outputs/6.5.314.4301/deploy_action_simple_step_32_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>GetObject</command>
      <object_list>
        <action>
          <comment>Created by PyTan v2.1.4</comment>
          <status>Open</status>
          <distribute_seconds>0</distribute_seconds>
          <start_time>2015-09-14T19:57:43</start_time>
          <creation_time>2015-09-14T19:57:41</creation_time>
          <skip_lock_flag>0</skip_lock_flag>
          <id>79</id>
          <expire_seconds>3300</expire_seconds>
          <name>API Deploy Distribute Tanium Standard Utilities</name>
          <stopped_flag>0</stopped_flag>
          <expiration_time>2015-09-14T20:52:43</expiration_time>
          <approver>
            <name>Administrator</name>
            <id>1</id>
          </approver>
          <package_spec>
            <name>Distribute Tanium Standard Utilities</name>
            <command>cmd /c cscript install-standard-utils.vbs "Tools\StdUtils"</command>
            <id>23</id>
          </package_spec>
          <saved_action>
            <id>78</id>
          </saved_action>
          <history_saved_question>
            <id>98</id>
          </history_saved_question>
          <target_group>
            <name>Default</name>
            <id>0</id>
          </target_group>
          <action_group>
            <name>Default</name>
            <id>0</id>
          </action_group>
          <user>
            <name>Administrator</name>
            <last_login>2015-09-14T19:57:41</last_login>
            <group_id>0</group_id>
            <id>1</id>
          </user>
        </action>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>